#ifndef DADO_HH
#define DADO_HH

#include <iostream>
#include <fstream>
#include <vector>
#include <string>

/**
 * @brief Information for the dice roll
 *
 */
struct DiceInfo {
    long long times_1;
    long long times_2;
    long long times_3;
    long long times_4;
    long long times_5;
    long long times_6;
    long long total;
};

/**
 * @brief typedef to define a Matrix (vector of vectors)
 *
 */
typedef std::vector<std::vector<std::string>> Matrix;


const Matrix FACE_1 = {
    {"╭","─","─","─","─","─","─","─","─","─","─","─","╮"},
    {"│"," "," "," "," "," "," "," "," "," "," "," ","│"},
    {"│"," "," "," "," "," ","●"," "," "," "," "," ","│"},
    {"│"," "," "," "," "," "," "," "," "," "," "," ","│"},
    {"╰","─","─","─","─","─","─","─","─","─","─","─","╯"}
};
const Matrix FACE_2 = {
    {"╭","─","─","─","─","─","─","─","─","─","─","─","╮"},
    {"│"," "," ","●"," "," "," "," "," "," "," "," ","│"},
    {"│"," "," "," "," "," "," "," "," "," "," "," ","│"},
    {"│"," "," "," "," "," "," "," "," ","●"," "," ","│"},
    {"╰","─","─","─","─","─","─","─","─","─","─","─","╯"}
};
const Matrix FACE_3 = {
    {"╭","─","─","─","─","─","─","─","─","─","─","─","╮"},
    {"│"," "," ","●"," "," "," "," "," "," "," "," ","│"},
    {"│"," "," "," "," "," ","●"," "," "," "," "," ","│"},
    {"│"," "," "," "," "," "," "," "," ","●"," "," ","│"},
    {"╰","─","─","─","─","─","─","─","─","─","─","─","╯"}
};
const Matrix FACE_4 = {
    {"╭","─","─","─","─","─","─","─","─","─","─","─","╮"},
    {"│"," "," ","●"," "," "," "," "," ","●"," "," ","│"},
    {"│"," "," "," "," "," "," "," "," "," "," "," ","│"},
    {"│"," "," ","●"," "," "," "," "," ","●"," "," ","│"},
    {"╰","─","─","─","─","─","─","─","─","─","─","─","╯"}
};
const Matrix FACE_5 = {
    {"╭","─","─","─","─","─","─","─","─","─","─","─","╮"},
    {"│"," "," ","●"," "," "," "," "," ","●"," "," ","│"},
    {"│"," "," "," "," "," ","●"," "," "," "," "," ","│"},
    {"│"," "," ","●"," "," "," "," "," ","●"," "," ","│"},
    {"╰","─","─","─","─","─","─","─","─","─","─","─","╯"}
};
const Matrix FACE_6 = {
    {"╭","─","─","─","─","─","─","─","─","─","─","─","╮"},
    {"│"," "," ","●"," "," "," "," "," ","●"," "," ","│"},
    {"│"," "," ","●"," "," "," "," "," ","●"," "," ","│"},
    {"│"," "," ","●"," "," "," "," "," ","●"," "," ","│"},
    {"╰","─","─","─","─","─","─","─","─","─","─","─","╯"}
};


/**
 * @brief Print the die to the output stream
 *
 * @param out Output stream
 * @param m Matrix with the selected die face
 * @param n Die face number
 */
void print_die(std::ostream& out, const Matrix& m, int n);


/**
 * @brief Select a die face and update its statistics
 *
 * @param n Face number that was rolled
 * @param history Output stream for saving the history
 * @param d Roll information
 */
void select_die(int n, std::ostream& history, DiceInfo& d, bool& b);


/**
 * @brief Output the dice roll statistics
 *
 * @param statistics File to write to
 * @param d All roll information
 */
void print_statistics(std::ostream& statistics, DiceInfo& d);

#endif
